/* General */

"OK" = "אישור";

"Cancel" = "ביטול";

"Copy" = "העתק";

"Add" = "הוסף";

"Remove" = "הסר";

"Replace" = "המשך";

"This cannot be undone." = "לא ניתן לבטל את הפעולה הזאת.";

"Import" = "ייבא";

"Export As:" = ":ייצא בתור";

"Export" = "ייצא";


"The name \"%@\" is already taken." = "השם ״%@״ כבר תפוס";

"Please choose a different name." = "אנא בחר/י שם שונה.";


/* Menus */

"Show Toolbar" = "הצג את סרגל הכלים";

"Hide Toolbar" = "הסתר את סרגל הכלים";


"Show Sidebar" = "הצג את סרגל הצד";

"Hide Sidebar" = "הסתר את סרגל הצד";

"Show Binary Images" = "הצג את קבצים בינאריי";

"Hide Binary Images" = "הסתר את קבצים בינאריי";

"Show Inspector" = "הצג את הסוקר";

"Hide Inspector" = "הסתר את הסוקר";

"Show Registers" = "הצג את אוגרים";

"Hide Registers" = "הסתר את אוגרים";

/* About box */

"version %@ (%@)" = "גירסה %@ (%@)";

/* Themes Editor */

" copy" = " עותק של";

"Do you really want to remove the \"%@\" theme?" = "האם הינך באמת רוצה להסיר את ערכת הנושא ״%@״?";

"Do you really want to restore the default Fonts & Colors settings?" = "האם אתה באמת רוצה לשחזר את הגדרות ברירת המחדל של גופנים וצבעים?";

"You will lose all the changes you made." = "אתה תאבד את כל השינויים שביצעת.";

"Restore" = "שחזר";

"Keep Both" = "השאר את שניהם";

    /* Colors labels */

"Background" = "רקע";

"Plain Text" = "מלל פשוט";

"Key" = "מפתח";

"Thread Label" = "תווית של שרשור";

"Crashed Thread Label" = "תווית של שרשור שקרס";

"Executable Code" = "קוד שניתן להרצה";

"OS Code" = "OS קוד של";

"Memory Address" = "כתובת זיכרון";

"Register Value" = "ערך של אוגר";

"File Path" = "נתיב הקובץ";

"Version" = "גירסה";

"UUID" = "UUID";

"Line Number" = "מספר שורה";

/* Sources */

"All" = "הכל";

"All reports from all sources" = "כל דוחות מכל המקורות";

"User Reports" = "דוחות המשתמש";

"System Reports" = "דוחות המערכת";

"Untitled source" = "מקור ללא כותרת";

"Recents" = "אחרונים";

"Reports from the last 24 hours" = "דוחות מ-24 השעות האחרונות";

"Move All \"%@\" Reports to Trash" = "העבר את כל הדוחות של ״%@״ לפח";

/* Navigation bar */

"%@ - %@" = "\U200E%2$@ - \U200F%1$@";

/* Inspectors */

"%@:" = ":%@";

"Unknown version" = "גירסה לא ידוע";

"Version %@" = "גירסה %@";

"No Selection" = "לא בוצעה בחירה";

"Not Available" = "לא זמין";

"%@ (%u)" = "(%2$u) %1$@";

/* Views */

"Thread %ld" = "%ld שרשור";

/* Sections */

"Header" = "כותרת";

"Exception Information" = "מידע על חריג";

"Diagnostic Messages" = "הודעות אבחון";

"Backtraces" = "עקבות חזרה";

"Thread State" = "מצב השרשור";

"Binary Images" = "קבצים בינאריים";

/* Outline */

"Diagnostics\n\n" = "אבחון\n\n";

"No backtraces available" = "אין עקבות חזרה זמינים";

"Copy Machine Instruction Address" = "העתק כתובת של פקודת מכונה";

"Copy Binary Image Offset" = "העתק את ההיסט של התמונה הבינארית";

"Show In" = "הצג ב";

/* Binary Images */

"%@ (%@)" = "\U200E(%2$@) \U200F%1$@";

/* Registers window */

"Registers" = "אוגרים";

"Registers - %@" = "%@ - אוגרים";

"Registers state not available" = "הערכים של האוגרים אינם זמינים.";

    /* Register name */

"%@:" = ":%@";

/* Symbolication */

"line" = "שורה";

"column" = "עמודה";

/* Export */

"The export operation failed." = "פעולת הייצוא נכשלה.";

/* Open Errors panel */

"An error occurred while opening the file." = "ארעה שגיאה בעת פתיחת הקובץ.";

"An error occurred while opening some files." = "אירעה שגיאה בעת פתיחת קבצים מסוימים.";

"The file can't be opened for the following reason:" = ":לא ניתן לפתוח את הקובץ מהסיבה הבאה";

"These files can't be opened for the following reasons:" = ":לא ניתן לפתוח קבצים אלה מהסיבות הבאות";


"This file is empty." = "הקובץ הזה ריק.";

"The format of this file is invalid or unsupported." = ".המבנה של הקובץ זו אינו חוקי או לא נתמך";

"You don't have permission to view this file." = "אין לך הרשאה לצפות בקובץ זה.";

"Name" = "שם";

"Reason" = "סיבה";


